function showLoveMessage() {
    const messages = [
    "عشق من، تو تنها دلیل لبخندهای من هستی.",
    "وقتی تو را در کنار خود دارم، همه دنیا برایم زیباتر می‌شود.",
    "حضور تو زندگی‌ام را پر از نور و خوشبختی می‌کند.",
    "هر لحظه بدون تو مانند یک عمر بی‌پایان است.",
    "عاشق شدن به تو بزرگ‌ترین هدیه‌ای است که زندگی به من داده است.",
    "دلم برای هر لحظه با تو بودن تنگ شده است.",
    "با هر نگاه تو، قلبم تندتر می‌تپد.",
    "تو تنها کسی هستی که می‌تواند روحم را به آرامش برساند.",
    "زندگی با تو شگفت‌انگیزتر و پر از ماجراست.",
    "عشق تو برای من مانند هوایی است که نفس می‌کشم.",
    "مهران تا همیشه دوستت دارد کاملا صادقانه"
];
    
    const message = messages[Math.floor(Math.random() * messages.length)];
    document.getElementById('message').innerText = message;
}
